#+TITLE: Emacs Dotfiles Of Raelon "th3r00t" Masters
#+AUTHOR: Raelon "th3r00t" Masters
#+EMAIL: admin@mylt.dev
https://orgmode.org/manual/Initial-visibility.html
#+STARTUP: overview
#+begin_src emacs-lisp
  (setq evil-want-keybinding nil)
#+end_src
***** config
#+begin_src emacs-lisp
  (setq-default
   emms-source-file-default-directory "/mnt/homeserver/Storage/Music"

   emms-source-playlist-default-format 'm3u
   emms-playlist-mode-center-when-go t
   emms-playlist-default-major-mode 'emms-playlist-mode
   emms-show-format "NP: %s"

   emms-player-list '(emms-player-mpv)
   emms-player-mpv-environment '("PULSE_PROP_media.role=music")
   emms-player[[id:06c97e1e-5602-405b-8434-0ce12c44e03f][Guides]]-mpv-parameters '("--quiet" "--really-quiet" "--no-audio-display" "--force-window=no" "--vo=null"))
#+end_src

#+RESULTS:
| --quiet | --really-quiet | --no-audio-display | --force-window=no | --vo=null |

